Repository: kanglib/3beol-nimf
Catalog: po/*.po
Languages: de, ja

source: Log debugging message
de: Debug Nachrichten protokollieren
ja: デバッグメッセージを記録します。

source: Version
ja: バージョン

source: Please report a bug. (keyval: %d)
de: Bitte melden Sie einen Fehler (keyval: %d)
ja: バグを報告してください。 (keyval: %d)

source: Press key combination
de: Tastenkombination drücken
ja: キーの組み合わせを押してください

source: _OK
de: Bestätigen (_O)
ja: よし (_O)

source: _Cancel
de: Abbrechen (_C)
ja: キャンセル (_C)

source: Click here and then press key combination
de: Hier klicken und dann Tastenkombination drücken
ja: ここをクリックして、キーの組み合わせを押してください

source: Default
de: Standard
ja: デフォルト

source: Nimf Settings
de: Nimf Einstellungen
ja: ニンフ設定

source: XKB Options
de: XKB-Optionen
ja: XKBオプション

source: Nimf
ja: ニンフ

source: Romaji
ja: ロマジ

source: English Keyboard (pc104)
ja: 英語キーボード（pc104）

source: Common practice
ja: 一般的な方法

source: Explicitly type nn
ja: 明示的にnnと入力します

source: Dubeolsik
ja: 2ボル式

source: Dubeolsik Yetgeul
ja: 2ボル式古文

source: Sebeolsik Dubeol Layout
ja: 3ボル式二着配列

source: Sebeolsik 390
ja: 3ボル式390

source: Sebeolsik Final
ja: 3ボル式最終

source: Sebeolsik Noshift
ja: 3ボル式純下

source: Sebeolsik Yetgeul
ja: 3ボル式古文

source: Romaja
ja: ローマ字

source: Ahnmatae
ja: アンマテ

source: Amharic
de: Amharisch
ja: アムハラ語

source: Arabic
de: Arabisch
ja: アラビア語

source: Assamese
ja: アッサム

source: Athabaskan languages
de: Athabaskische Sprachen
ja: アサバスカ語

source: Belarusian
de: Belarussisch
ja: ベラルーシ語

source: Siksika
ja: シクシカ

source: Bengali
ja: ベンガル語

source: Tibetan
de: Tibetaner
ja: チベット語

source: Chamic Languages
de: Chamic Sprachen
ja: カミック言語

source: Cree
ja: クリー語

source: Czech
de: Tschechisch
ja: チェコ語

source: Danish
de: Dänisch
ja: デンマーク語

source: Divehi
ja: ディヴェヒ

source: Greek
de: Griechisch
ja: ギリシャ語

source: English
de: Englisch
ja: 英語

source: Esperanto
ja: エスペラント

source: Persian
de: Persisch
ja: ペルシャ語

source: French
de: Französisch
ja: フランス語

source: Ancient Greek
de: Altgriechisch
ja: 古代ギリシャ語

source: Gujarati
ja: グジャラート語

source: Hebrew
de: Hebräisch
ja: ヘブライ語

source: Hindi
ja: ヒンディー語

source: Croatian
de: kroatisch
ja: クロアチア語

source: Hungarian
de: Ungarisch
ja: ハンガリー語

source: Armenian
de: Armenisch
ja: アルメニア語

source: Sichuan Yi
ja: 四川省

source: Inuktitut
ja: イヌクティット

source: Japanese
de: Japanisch
ja: 日本語

source: Georgian
de: Georgisch
ja: グルジア語

source: Kazakh
de: Kasachisch
ja: カザフ

source: Khmer
ja: クメール語

source: Kannada
ja: カンナダ語

source: Korean
de: Koreanisch
ja: 韓国語

source: Kashmiri
ja: カシミリ

source: Lao
ja: ラオス

source: Maithili
ja: マイティリ

source: Malayalam
ja: マラヤーラム語

source: Marathi
ja: マラーティー語

source: Burmese
de: Birmanisch
ja: ビルマ語

source: Nepali
ja: ネパール語

source: Naskapi language
de: Naskapi-Sprache
ja: ナスカピ言語

source: Ojibwa
ja: オジブワ

source: Oriya
ja: オリヤ

source: Punjabi
ja: パンジャブ語

source: Pushto
ja: プシュト

source: Russian
de: Russisch
ja: ロシア

source: Sanskrit
ja: サンスクリット

source: Sindhi
ja: シンディ

source: Sinhalese
de: Singhalesisch
ja: シンハラ語

source: Slovak
de: Slowakisch
ja: スロバキア

source: Serbian
de: Serbisch
ja: セルビア語

source: Swedish
de: Schwedisch
ja: スウェーデンの

source: Tai Viet
ja: 太極拳

source: Tamil
de: Tamilisch
ja: タミル語

source: Telugu
ja: テルグ語

source: Thai
ja: タイ語

source: Etc
de: Usw
ja: 等

source: Ukrainian
de: Ukrainisch
ja: ウクライナ語

source: Uighur
ja: ウイグル語

source: Urdu
ja: ウルドゥー語

source: Uzbek
de: Usbekisch
ja: ウズベク語

source: Vietnamese
de: Vietnamesisch
ja: ベトナム語

source: Yiddish
de: Jiddisch
ja: イディッシュ語

source: Chinese
de: Chinesisch
ja: 中国語

source: Rime
ja: ライム

source: Hodong Kim <cogniti@gmail.com>
ja: キム・ホドン <cogniti@gmail.com>

source: Bumsik Kim <k.bumsik@gmail.com>
ja: キム・ボムシク <k.bumsik@gmail.com>

source: Nimf is an input method framework
de: Nimf ist eine Texteingabemethode
ja: ニンフはインプットメソッドフレームワークです。

source: Copyright (c) 2015-2019 Hodong Kim
ja: 著作権 (c) 2015-2019 キム・ホドン

source: Hodong Kim, Max Neupert
ja: キム・ホドン, Max Neupert

source: Website
ja: ウェブサイト

source: Settings
de: Einstellungen
ja: 設定

source: About
de: Über
ja: 情報

source: xkb options
de: xkb-optionen
ja: xkbのオプション

source: 'Nimf'
ja: 'ニンフ'

source: schema name for nimf-settings
de: nimf-settings Schema name
ja: nimf-settingsのためのスキーマ名

source: This key is intended for nimf-settings.
de: Dieser Schlüssel ist für nimf-settings bestimmt.
ja: このキーは、nimf-settingsのために設計されて。

source: Hotkeys for switching input method engine
de: Tastenkombinationen um die Eingabemethode zu wechseln
ja: 入力エンジンを切り替えるためのホットキー

source: Use singleton mode
de: Singleton mode verwenden
ja: シングルトンモードを使用します

source: Create one instance per language engine. Singleton mode reduces memory usage.
de: Erstellen Sie eine Instanz pro Sprachmodul. Der Singleton-Modus reduziert den Speicherbedarf.
ja: 言語エンジンごとに1つのインスタンスを作成します。 シングルトンモードはメモリ使用量を減らします。

source: 'Services'
ja: 'サービス'

source: 'Clients'
ja: 'クライアント'

source: 'Engines'
ja: 'エンジン'

source: Default language engine
de: Voreingestellte Sprach-Engine
ja: デフォルト言語エンジン

source: Default language engine on startup
de: Voreingestellte Sprach-Engine beim Start
ja: 起動時のデフォルト言語エンジン

source: hooking gdk key events
ja: gdkキーイベントをフックする

source: filter all key events before delivering them normally, which avoids bugs of many applications
de: Alle Tasten-Ereignisse filtern bevor sie normal weitergeleitet werden, dies verhindert Fehler in vielen Anwendungen
ja: すべてのキーイベントを送出する前に、それらをろ過します。これは、複数のアプリケーションのバグを回避します。

source: Reset when clicking the mouse button
de: Zurücksetzen bei Mausklick
ja: マウスボタンをクリックしたときにリセットします

source: 'Japanese (anthy)'
de: 'Japanisch (Anthy)'
ja: '日本語 (anthy)'

source: Active engine
de: Aktive Engine
ja: エンジン有効に

source: The engine will be loaded on startup if available. Restart required
de: Die Engine wird, wenn vorhanden, beim Start geladen. Neustart erforderlich
ja: もし可能であればこのエンジンは、起動時にロードされます。再起動が必要になります。

source: Trigger keys for switching Japanese / System
de: Auslösertasten um Japanisch / System umzuschalten
ja: 日本語/システム切り替えのためのトリガーキー

source: Hotkey for Hiragana
de: Hotkey für Hiragana
ja: ひらがな用ホットキー

source: Hotkeys for converting to Hiragana
de: Hotkeys zum Umwandeln in Hiragana
ja: ひらがなに変換するためのホットキー

source: Hotkey for Katakana
de: Hotkey für Katakana
ja: カタカナのホットキー

source: Hotkeys for converting to Katakana
de: Hotkeys zum Umwandeln in Katakana
ja: カタカナに変換するためのホットキー

source: Input method
de: Eingabe Methode
ja: 入力方式

source: n input mode
de: n Eingabemodus
ja: n入力モード

source: Choose how you type hiragana letter n.
de: Wählen Sie, wie Sie den Hiragana-Buchstaben n eingeben.
ja: ひらがな文字んを入力する方法を選択してください。

source: 'Korean (libhangul)'
de: 'Koreanisch (libhangul)'
ja: '韓国語 (libhangul)'

source: Trigger keys for switching Korean / System
de: Auslösertasten um Koreanisch / System umzuschalten
ja: 韓国語/システムの切り替え用のトリガーキー

source: Binding to change Korean / System
de: Bindung um zwischen Koreansich / System zu wechseln
ja: 韓国/システムを変更するためのバインディング

source: Hotkey for Hanja
de: Tastenkürzel für Hanja
ja: 漢字のためのホットキー

source: Binding to Hanja key
de: Bindung zur Hanja Taste
ja: 漢字キーのバインディング

source: Use a rule composing double consonants
de: Eine Regel verwenden um Doppelkonsonanten zu bilden
ja: 二重子音組み合わせルールを使用します

source: compose a double consonant on pressing same consonant twice
de: Bilde Doppelkonsonant beim doppelten Pressen des selben Konsonanten
ja: 同じ子音を二度押すと、二重子音を組み合わせます

source: Auto-reordering in Dubeolsik
de: Auto-Neuordnung in Dubeolsik
ja: 2ボル式で自動並べ替え

source: Ignore reset() in commit callback
de: Ignoriere reset() in commit Rückmeldung
ja: commitコールバックでreset()を無視します

source: Ignore reset() called by commit callback in application
ja: アプリケーションでcommitコールバックが呼び出されるreset()を無視します

source: 'Other languages (m17n)'
de: 'Andere Sprachen (m17n)'
ja: 'その他の言語（m17n）'

source: Trigger keys for switching m17n / System
de: Auslösertasten um m17n / System umzuschalten
ja: m17n/システムの切り替え用のトリガーキー

source: 'Chinese (rime)'
de: 'Chinesisch (rime)'
ja: '中国語 (rime)'

source: Trigger keys for switching Chinese / System
de: Auslösertasten um Chinesisch / System umzuschalten
ja: 中国語/システムの切り替え用のトリガーキー

source: Simplified Chinese
de: Vereinfachtes Chinesisch
ja: 簡体字中国語

source: If Simplified Chinese is set, Simplified Chinese is used. Otherwise Traditional Chinese is used.
de: Wenn vereinfachtes Chinesisch gesetzt ist, wird vereinfachtes Chinesisch verwendet. Ansonsten wird traditionelles Chinesisch verwendet.
ja: 簡体字中国語が設定されると、簡体字中国語が使用されます。そうでなければ、繁体字中国語が使用されます。

source: 'System Keyboard'
ja: 'システムキーボード'

source: Trigger keys for switching to System Keyboard
de: Auslösetasten für den Wechsel zur Systemtastatur
ja: システムキーボードに切り替えるためのトリガーキー

source: Japanese input mode
de: Japanischer Eingabemodus

source: key value for UI l10n
de: Schlüsselwert für UI l10n

source: 'Kana input on the English Keyboard (pc104)'
de: 'Kana-Eingang auf der englischen Tastatur (pc104)'

source: 'Common practice'
de: 'Gang und gäbe sein'

source: 'Explicitly type nn'
de: 'Typ Explizit nn'

source: Korean keyboard layout
de: Koreanisches Tastaturlayout

source: Always draw preedit string on the server-side
de: Zeichnen Sie immer eine Preedit-Zeichenfolge auf der Serverseite

source: If you have trouble viewing preedit string, check this option.
de: Wenn Sie Probleme beim Anzeigen der Pre-Edit-Zeichenfolge haben, aktivieren Sie diese Option.
